       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING PROG1"
           CALL "PROG2"
           CALL "PROG4"
           STOP RUN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG2.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING PROG2"
           CALL "PROG3"
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG3.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING PROG3"
           GOBACK.
       END PROGRAM PROG3.

       END PROGRAM PROG2.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG4.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING PROG4"
           GOBACK.
       END PROGRAM PROG4.

       END PROGRAM PROG1.
