       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUB1.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING SUB1"
           CALL "SUB2"
           STOP RUN.
       END PROGRAM SUB1.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUB2.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING SUB2"
           GOBACK.
       END PROGRAM SUB2.
