      * --------------------------------------
      * The structure of an department record.
      * --------------------------------------
       01  :PREFIX:-DEPT-REC.
           05  :PREFIX:-DEPT-ID            PIC 9(004).
           05  :PREFIX:-DEPT-NAME          PIC X(010).
           05  :PREFIX:-DEPT-MANAGER-ID    PIC 9(004).
           05  :PREFIX:-DEPT-MANAGER-NAME  PIC X(010).
           05  :PREFIX:-DEPT-MEMBER-COUNT  PIC 9(004).
