       IDENTIFICATION DIVISION.
       PROGRAM-ID. subroutine.
       PROCEDURE DIVISION.
           DISPLAY "RUNNING subroutine"
           GOBACK.
       END PROGRAM subroutine.
